snkYmkrct/circuitpython--snakey--/ports/stm/boards/daisy_seed_with_sdram/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2024 snkYmkrct
//
// SPDX-License-Identifier: MIT

// Micropython setup

#define MICROPY_HW_BOARD_NAME       "DAISY_SEED"
#define MICROPY_HW_MCU_NAME         "STM32H750xx"

#define MICROPY_HW_LED_STATUS (&pin_PC07)

// H7 and F7 MPU definitions
#define CPY_FLASH_REGION_SIZE   ARM_MPU_REGION_SIZE_8MB
#define CPY_ITCM_REGION_SIZE    ARM_MPU_REGION_SIZE_64KB
#define CPY_DTCM_REGION_SIZE    ARM_MPU_REGION_SIZE_128KB
#define CPY_SRAM_REGION_SIZE    ARM_MPU_REGION_SIZE_512KB
// enable D2 and D3 ram too ?
#define CPY_SRAM_SUBMASK        0x00
#define CPY_SRAM_START_ADDR     0x24000000

#define HSE_VALUE ((uint32_t)16000000)
#define BOARD_HSE_SOURCE (RCC_HSE_ON) // use external oscillator
#define BOARD_HAS_LOW_SPEED_CRYSTAL (0)

#define CIRCUITPY_CONSOLE_UART_TX (&pin_PB09)
#define CIRCUITPY_CONSOLE_UART_RX (&pin_PB08)

// USB
#define BOARD_NO_USB_OTG_ID_SENSE (1)

// for RNG not audio
#define CPY_CLK_USB_USES_AUDIOPLL (1)

// SDRAM -- on FMC controller
#define CIRCUITPY_HW_FMC_SDCKE0
#define CIRCUITPY_HW_FMC_SDNE0

#define CIRCUITPY_HW_SDRAM_SIZE               (64 * 1024 * 1024)  // 64 MByte
#define CIRCUITPY_HW_SDRAM_STARTUP_TEST       (1)
#define CIRCUITPY_HW_FMC_SWAP_BANKS           (0)

#define CIRCUITPY_HW_SDRAM_CLOCK_PERIOD       2
#define CIRCUITPY_HW_SDRAM_CAS_LATENCY        3
#define CIRCUITPY_HW_SDRAM_FREQUENCY_KHZ      (100000) // 100 MHz
#define CIRCUITPY_HW_SDRAM_TIMING_TMRD        (2)
#define CIRCUITPY_HW_SDRAM_TIMING_TXSR        (8)
#define CIRCUITPY_HW_SDRAM_TIMING_TRAS        (5)
#define CIRCUITPY_HW_SDRAM_TIMING_TRC         (6)
#define CIRCUITPY_HW_SDRAM_TIMING_TWR         (3)
#define CIRCUITPY_HW_SDRAM_TIMING_TRP         (2)
#define CIRCUITPY_HW_SDRAM_TIMING_TRCD        (2)

#define CIRCUITPY_HW_SDRAM_ROW_BITS_NUM       13
#define CIRCUITPY_HW_SDRAM_MEM_BUS_WIDTH      32
#define CIRCUITPY_HW_SDRAM_REFRESH_CYCLES     8192

#define CIRCUITPY_HW_SDRAM_COLUMN_BITS_NUM    9
#define CIRCUITPY_HW_SDRAM_INTERN_BANKS_NUM   4
#define CIRCUITPY_HW_SDRAM_RPIPE_DELAY        0
#define CIRCUITPY_HW_SDRAM_RBURST             (1)
#define CIRCUITPY_HW_SDRAM_WRITE_PROTECTION   (0)

#define CIRCUITPY_HW_SDRAM_AUTOREFRESH_NUM    (8)
#define CIRCUITPY_HW_SDRAM_BURST_LENGTH       1
#define CIRCUITPY_HW_SDRAM_REFRESH_RATE       (64) // ms
